src/testsuite/sysbench/results/oltp_delete.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 276.10 qps: 276.10 (r/w/o: 0.00/273.84/2.27) lat (ms,95%): 390.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 281.75 qps: 281.75 (r/w/o: 0.00/275.60/6.15) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 201.15 qps: 201.15 (r/w/o: 0.00/195.25/5.90) lat (ms,95%): 1069.86 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           14728
        other:                           303
        total:                           15031
    transactions:                        15031  (247.46 per sec.)
    queries:                             15031  (247.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      247.4617
    time elapsed:                        60.7415s
    total number of events:              15031

Latency (ms):
         min:                                   73.36
         avg:                                  258.53
         max:                                 1736.61
         95th percentile:                      612.21
         sum:                              3885960.99

Threads fairness:
    events (avg/stddev):           234.8594/3.47
    execution time (avg/stddev):   60.7181/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 228.31 qps: 228.31 (r/w/o: 0.00/217.98/10.33) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 501.50 qps: 501.50 (r/w/o: 0.00/472.05/29.45) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 509.15 qps: 509.15 (r/w/o: 0.00/469.50/39.65) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           24298
        other:                           1659
        total:                           25957
    transactions:                        25957  (432.34 per sec.)
    queries:                             25957  (432.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      432.3389
    time elapsed:                        60.0392s
    total number of events:              25957

Latency (ms):
         min:                                   26.03
         avg:                                  148.09
         max:                                  941.72
         95th percentile:                      200.47
         sum:                              3843888.46

Threads fairness:
    events (avg/stddev):           405.5781/4.04
    execution time (avg/stddev):   60.0608/0.01